Revit 2026 API

# RebarHookOrientation Enumeration

---

**Note: This API is now obsolete.**

Orientation of a rebar hook relative to the path of the Rebar Shape.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This enumeration is deprecated in Revit 2026 and may be removed in a later version of Revit. You can use RebarTerminationOrientation enumeration instead.")]
public enum RebarHookOrientation
```
```vb
<ObsoleteAttribute("This enumeration is deprecated in Revit 2026 and may be removed in a later version of Revit. You can use RebarTerminationOrientation enumeration instead.")>
Public Enumeration RebarHookOrientation
```
```cpp
[ObsoleteAttribute(L"This enumeration is deprecated in Revit 2026 and may be removed in a later version of Revit. You can use RebarTerminationOrientation enumeration instead.")]
public enum class RebarHookOrientation
```
```fsharp
[<ObsoleteAttribute("This enumeration is deprecated in Revit 2026 and may be removed in a later version of Revit. You can use RebarTerminationOrientation enumeration instead.")>]
type RebarHookOrientation
```

| Member name | Value | Description |
| --- | --- | --- |
| Left | 1 | Hook towards the left of a segment-based shape (RebarShapeDefinitionBySegments), or to the interior of an arc-based shape (RebarShapeDefinitionByArc). |
| Right | -1 | Hook towards the right of a segment-based shape (RebarShapeDefinitionBySegments), or to the exterior of an arc-based shape (RebarShapeDefinitionByArc). |

#### Reference

Autodesk.Revit.DB.Structure Namespace